GopalSaraf/Practicals/PSDL/include/proc/pic12f1612.inc
// Register: CWG1AS0
#define CWG1AS0 CWG1AS0
CWG1AS0                                  equ 0693h
// bitfield definitions
CWG1AS0_LSAC_POSN                        equ 0002h
CWG1AS0_LSAC_POSITION                    equ 0002h
CWG1AS0_LSAC_SIZE                        equ 0002h
CWG1AS0_LSAC_LENGTH                      equ 0002h
CWG1AS0_LSAC_MASK                        equ 000Ch
CWG1AS0_LSBD_POSN                        equ 0004h
CWG1AS0_LSBD_POSITION                    equ 0004h
CWG1AS0_LSBD_SIZE                        equ 0002h
CWG1AS0_LSBD_LENGTH                      equ 0002h
CWG1AS0_LSBD_MASK                        equ 0030h
CWG1AS0_REN_POSN                         equ 0006h
CWG1AS0_REN_POSITION                     equ 0006h
CWG1AS0_REN_SIZE                         equ 0001h
CWG1AS0_REN_LENGTH                       equ 0001h
CWG1AS0_REN_MASK                         equ 0040h
CWG1AS0_SHUTDOWN_POSN                    equ 0007h
CWG1AS0_SHUTDOWN_POSITION                equ 0007h
CWG1AS0_SHUTDOWN_SIZE                    equ 0001h
CWG1AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG1AS0_SHUTDOWN_MASK                    equ 0080h
CWG1AS0_LSAC0_POSN                       equ 0002h
CWG1AS0_LSAC0_POSITION                   equ 0002h
CWG1AS0_LSAC0_SIZE                       equ 0001h
CWG1AS0_LSAC0_LENGTH                     equ 0001h
CWG1AS0_LSAC0_MASK                       equ 0004h
CWG1AS0_LSAC1_POSN                       equ 0003h
CWG1AS0_LSAC1_POSITION                   equ 0003h
CWG1AS0_LSAC1_SIZE                       equ 0001h
CWG1AS0_LSAC1_LENGTH                     equ 0001h
CWG1AS0_LSAC1_MASK                       equ 0008h
CWG1AS0_LSBD0_POSN                       equ 0004h
CWG1AS0_LSBD0_POSITION                   equ 0004h
CWG1AS0_LSBD0_SIZE                       equ 0001h
CWG1AS0_LSBD0_LENGTH                     equ 0001h
CWG1AS0_LSBD0_MASK                       equ 0010h
CWG1AS0_LSBD1_POSN                       equ 0005h
CWG1AS0_LSBD1_POSITION                   equ 0005h
CWG1AS0_LSBD1_SIZE                       equ 0001h
CWG1AS0_LSBD1_LENGTH                     equ 0001h
CWG1AS0_LSBD1_MASK                       equ 0020h
CWG1AS0_CWG1LSAC_POSN                    equ 0002h
CWG1AS0_CWG1LSAC_POSITION                equ 0002h
CWG1AS0_CWG1LSAC_SIZE                    equ 0002h
CWG1AS0_CWG1LSAC_LENGTH                  equ 0002h
CWG1AS0_CWG1LSAC_MASK                    equ 000Ch
CWG1AS0_CWG1LSBD_POSN                    equ 0004h
CWG1AS0_CWG1LSBD_POSITION                equ 0004h
CWG1AS0_CWG1LSBD_SIZE                    equ 0002h
CWG1AS0_CWG1LSBD_LENGTH                  equ 0002h
CWG1AS0_CWG1LSBD_MASK                    equ 0030h
CWG1AS0_CWG1REN_POSN                     equ 0006h
CWG1AS0_CWG1REN_POSITION                 equ 0006h
CWG1AS0_CWG1REN_SIZE                     equ 0001h
CWG1AS0_CWG1REN_LENGTH                   equ 0001h
CWG1AS0_CWG1REN_MASK                     equ 0040h
CWG1AS0_CWG1SHUTDOWN_POSN                equ 0007h
CWG1AS0_CWG1SHUTDOWN_POSITION            equ 0007h
CWG1AS0_CWG1SHUTDOWN_SIZE                equ 0001h
CWG1AS0_CWG1SHUTDOWN_LENGTH              equ 0001h
CWG1AS0_CWG1SHUTDOWN_MASK                equ 0080h
CWG1AS0_CWG1LSAC0_POSN                   equ 0002h
CWG1AS0_CWG1LSAC0_POSITION               equ 0002h
CWG1AS0_CWG1LSAC0_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC0_MASK                   equ 0004h
CWG1AS0_CWG1LSAC1_POSN                   equ 0003h
CWG1AS0_CWG1LSAC1_POSITION               equ 0003h
CWG1AS0_CWG1LSAC1_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC1_MASK                   equ 0008h
CWG1AS0_CWG1LSBD0_POSN                   equ 0004h
CWG1AS0_CWG1LSBD0_POSITION               equ 0004h
CWG1AS0_CWG1LSBD0_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD0_MASK                   equ 0010h
CWG1AS0_CWG1LSBD1_POSN                   equ 0005h
CWG1AS0_CWG1LSBD1_POSITION               equ 0005h
CWG1AS0_CWG1LSBD1_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD1_MASK                   equ 0020h

// Register: CWG1AS1
#define CWG1AS1 CWG1AS1
CWG1AS1                                  equ 0694h
// bitfield definitions
CWG1AS1_INAS_POSN                        equ 0000h
CWG1AS1_INAS_POSITION                    equ 0000h
CWG1AS1_INAS_SIZE                        equ 0001h
CWG1AS1_INAS_LENGTH                      equ 0001h
CWG1AS1_INAS_MASK                        equ 0001h
CWG1AS1_C1AS_POSN                        equ 0001h
CWG1AS1_C1AS_POSITION                    equ 0001h
CWG1AS1_C1AS_SIZE                        equ 0001h
CWG1AS1_C1AS_LENGTH                      equ 0001h
CWG1AS1_C1AS_MASK                        equ 0002h
CWG1AS1_C2AS_POSN                        equ 0002h
CWG1AS1_C2AS_POSITION                    equ 0002h
CWG1AS1_C2AS_SIZE                        equ 0001h
CWG1AS1_C2AS_LENGTH                      equ 0001h
CWG1AS1_C2AS_MASK                        equ 0004h
CWG1AS1_TMR2AS_POSN                      equ 0004h
CWG1AS1_TMR2AS_POSITION                  equ 0004h
CWG1AS1_TMR2AS_SIZE                      equ 0001h
CWG1AS1_TMR2AS_LENGTH                    equ 0001h
CWG1AS1_TMR2AS_MASK                      equ 0010h
CWG1AS1_TMR4AS_POSN                      equ 0005h
CWG1AS1_TMR4AS_POSITION                  equ 0005h
CWG1AS1_TMR4AS_SIZE                      equ 0001h
CWG1AS1_TMR4AS_LENGTH                    equ 0001h
CWG1AS1_TMR4AS_MASK                      equ 0020h
CWG1AS1_TMR6AS_POSN                      equ 0006h
CWG1AS1_TMR6AS_POSITION                  equ 0006h
CWG1AS1_TMR6AS_SIZE                      equ 0001h
CWG1AS1_TMR6AS_LENGTH                    equ 0001h
CWG1AS1_TMR6AS_MASK                      equ 0040h
CWG1AS1_CWG1INAS_POSN                    equ 0000h
CWG1AS1_CWG1INAS_POSITION                equ 0000h
CWG1AS1_CWG1INAS_SIZE                    equ 0001h
CWG1AS1_CWG1INAS_LENGTH                  equ 0001h
CWG1AS1_CWG1INAS_MASK                    equ 0001h
CWG1AS1_CWG1C1AS_POSN                    equ 0001h
CWG1AS1_CWG1C1AS_POSITION                equ 0001h
CWG1AS1_CWG1C1AS_SIZE                    equ 0001h
CWG1AS1_CWG1C1AS_LENGTH                  equ 0001h
CWG1AS1_CWG1C1AS_MASK                    equ 0002h
CWG1AS1_CWG1C2AS_POSN                    equ 0002h
CWG1AS1_CWG1C2AS_POSITION                equ 0002h
CWG1AS1_CWG1C2AS_SIZE                    equ 0001h
CWG1AS1_CWG1C2AS_LENGTH                  equ 0001h
CWG1AS1_CWG1C2AS_MASK                    equ 0004h
CWG1AS1_CWG1TMR2AS_POSN                  equ 0004h
CWG1AS1_CWG1TMR2AS_POSITION              equ 0004h
CWG1AS1_CWG1TMR2AS_SIZE                  equ 0001h
CWG1AS1_CWG1TMR2AS_LENGTH                equ 0001h
CWG1AS1_CWG1TMR2AS_MASK                  equ 0010h
CWG1AS1_CWG1TMR4AS_POSN                  equ 0005h
CWG1AS1_CWG1TMR4AS_POSITION              equ 0005h
CWG1AS1_CWG1TMR4AS_SIZE                  equ 0001h
CWG1AS1_CWG1TMR4AS_LENGTH                equ 0001h
CWG1AS1_CWG1TMR4AS_MASK                  equ 0020h
CWG1AS1_CWG1TMR6AS_POSN                  equ 0006h
CWG1AS1_CWG1TMR6AS_POSITION              equ 0006h
CWG1AS1_CWG1TMR6AS_SIZE                  equ 0001h
CWG1AS1_CWG1TMR6AS_LENGTH                equ 0001h
CWG1AS1_CWG1TMR6AS_MASK                  equ 0040h

