GopalSaraf/Practicals/PSDL/include/proc/pic12f1612.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ACC0                             BANKMASK(CRCACCL), 0
#define ACC1                             BANKMASK(CRCACCL), 1
#define ACC10                            BANKMASK(CRCACCH), 2
#define ACC11                            BANKMASK(CRCACCH), 3
#define ACC12                            BANKMASK(CRCACCH), 4
#define ACC13                            BANKMASK(CRCACCH), 5
#define ACC14                            BANKMASK(CRCACCH), 6
#define ACC15                            BANKMASK(CRCACCH), 7
#define ACC2                             BANKMASK(CRCACCL), 2
#define ACC3                             BANKMASK(CRCACCL), 3
#define ACC4                             BANKMASK(CRCACCL), 4
#define ACC5                             BANKMASK(CRCACCL), 5
#define ACC6                             BANKMASK(CRCACCL), 6
#define ACC7                             BANKMASK(CRCACCL), 7
#define ACC8                             BANKMASK(CRCACCH), 0
#define ACC9                             BANKMASK(CRCACCH), 1
#define ACCM                             BANKMASK(CRCCON0), 4
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1AS                             BANKMASK(CWG1AS1), 1
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1OE                             BANKMASK(CM1CON0), 5
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 4
#define C1PCH1                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C2AS                             BANKMASK(CWG1AS1), 2
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OE                           BANKMASK(CCP1CON), 6
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1SEL                          BANKMASK(APFCON), 0
#define CCP1TSEL0                        BANKMASK(CCPTMRS), 0
#define CCP1TSEL1                        BANKMASK(CCPTMRS), 1
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 0
#define CCP2IF                           BANKMASK(PIR2), 0
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OE                           BANKMASK(CCP2CON), 6
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2TSEL0                        BANKMASK(CCPTMRS), 2
#define CCP2TSEL1                        BANKMASK(CCPTMRS), 3
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CFGS                             BANKMASK(PMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CRCACC0                          BANKMASK(CRCACCL), 0
#define CRCACC1                          BANKMASK(CRCACCL), 1
#define CRCACC10                         BANKMASK(CRCACCH), 2
#define CRCACC11                         BANKMASK(CRCACCH), 3
#define CRCACC12                         BANKMASK(CRCACCH), 4
#define CRCACC13                         BANKMASK(CRCACCH), 5
#define CRCACC14                         BANKMASK(CRCACCH), 6
#define CRCACC15                         BANKMASK(CRCACCH), 7
#define CRCACC2                          BANKMASK(CRCACCL), 2
#define CRCACC3                          BANKMASK(CRCACCL), 3
#define CRCACC4                          BANKMASK(CRCACCL), 4
#define CRCACC5                          BANKMASK(CRCACCL), 5
#define CRCACC6                          BANKMASK(CRCACCL), 6
#define CRCACC7                          BANKMASK(CRCACCL), 7
#define CRCACC8                          BANKMASK(CRCACCH), 0
#define CRCACC9                          BANKMASK(CRCACCH), 1
#define CRCACCM                          BANKMASK(CRCCON0), 4
#define CRCBUSY                          BANKMASK(CRCCON0), 5
#define CRCDAT0                          BANKMASK(CRCDATL), 0
#define CRCDAT1                          BANKMASK(CRCDATL), 1
#define CRCDAT10                         BANKMASK(CRCDATH), 2
#define CRCDAT11                         BANKMASK(CRCDATH), 3
#define CRCDAT12                         BANKMASK(CRCDATH), 4
#define CRCDAT13                         BANKMASK(CRCDATH), 5
#define CRCDAT14                         BANKMASK(CRCDATH), 6
#define CRCDAT15                         BANKMASK(CRCDATH), 7
#define CRCDAT2                          BANKMASK(CRCDATL), 2
#define CRCDAT3                          BANKMASK(CRCDATL), 3
#define CRCDAT4                          BANKMASK(CRCDATL), 4
#define CRCDAT5                          BANKMASK(CRCDATL), 5
#define CRCDAT6                          BANKMASK(CRCDATL), 6
#define CRCDAT8                          BANKMASK(CRCDATH), 0
#define CRCDAT9                          BANKMASK(CRCDATH), 1
#define CRCDLEN0                         BANKMASK(CRCCON1), 4
#define CRCDLEN1                         BANKMASK(CRCCON1), 5
#define CRCDLEN2                         BANKMASK(CRCCON1), 6
#define CRCDLEN3                         BANKMASK(CRCCON1), 7
#define CRCEN                            BANKMASK(CRCCON0), 7
#define CRCFULL                          BANKMASK(CRCCON0), 0
#define CRCGO                            BANKMASK(CRCCON0), 6
#define CRCIE                            BANKMASK(PIE4), 6
#define CRCIF                            BANKMASK(PIR4), 6
#define CRCPLEN0                         BANKMASK(CRCCON1), 0
#define CRCPLEN1                         BANKMASK(CRCCON1), 1
#define CRCPLEN2                         BANKMASK(CRCCON1), 2
#define CRCPLEN3                         BANKMASK(CRCCON1), 3
#define CRCSHIFT0                        BANKMASK(CRCSHIFTL), 0
#define CRCSHIFT1                        BANKMASK(CRCSHIFTL), 1
#define CRCSHIFT10                       BANKMASK(CRCSHIFTH), 2
#define CRCSHIFT11                       BANKMASK(CRCSHIFTH), 3
#define CRCSHIFT12                       BANKMASK(CRCSHIFTH), 4
#define CRCSHIFT13                       BANKMASK(CRCSHIFTH), 5
#define CRCSHIFT14                       BANKMASK(CRCSHIFTH), 6
#define CRCSHIFT15                       BANKMASK(CRCSHIFTH), 7
#define CRCSHIFT2                        BANKMASK(CRCSHIFTL), 2
#define CRCSHIFT3                        BANKMASK(CRCSHIFTL), 3
#define CRCSHIFT4                        BANKMASK(CRCSHIFTL), 4
#define CRCSHIFT5                        BANKMASK(CRCSHIFTL), 5
#define CRCSHIFT6                        BANKMASK(CRCSHIFTL), 6
#define CRCSHIFT7                        BANKMASK(CRCSHIFTL), 7
#define CRCSHIFT8                        BANKMASK(CRCSHIFTH), 0
#define CRCSHIFT9                        BANKMASK(CRCSHIFTH), 1
#define CRCSHIFTM                        BANKMASK(CRCCON0), 1
#define CRCXOR1                          BANKMASK(CRCXORL), 1
#define CRCXOR10                         BANKMASK(CRCXORH), 2
#define CRCXOR11                         BANKMASK(CRCXORH), 3
#define CRCXOR12                         BANKMASK(CRCXORH), 4
#define CRCXOR13                         BANKMASK(CRCXORH), 5
#define CRCXOR14                         BANKMASK(CRCXORH), 6
#define CRCXOR15                         BANKMASK(CRCXORH), 7
#define CRCXOR2                          BANKMASK(CRCXORL), 2
#define CRCXOR3                          BANKMASK(CRCXORL), 3
#define CRCXOR4                          BANKMASK(CRCXORL), 4
#define CRCXOR5                          BANKMASK(CRCXORL), 5
#define CRCXOR6                          BANKMASK(CRCXORL), 6
#define CRCXOR7                          BANKMASK(CRCXORL), 7
#define CRCXOR8                          BANKMASK(CRCXORH), 0
#define CRCXOR9                          BANKMASK(CRCXORH), 1
#define CRDCDAT7                         BANKMASK(CRCDATL), 7
#define CS                               BANKMASK(CWG1CLKCON), 0
#define CWG1C1AS                         BANKMASK(CWG1AS1), 1
#define CWG1C2AS                         BANKMASK(CWG1AS1), 2
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1INAS                         BANKMASK(CWG1AS1), 0
#define CWG1IS0                          BANKMASK(CWG1ISM), 0
#define CWG1IS1                          BANKMASK(CWG1ISM), 1
#define CWG1IS2                          BANKMASK(CWG1ISM), 2
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OEA                          BANKMASK(CWG1OCON1), 0
#define CWG1OEB                          BANKMASK(CWG1OCON1), 1
#define CWG1OEC                          BANKMASK(CWG1OCON1), 2
#define CWG1OED                          BANKMASK(CWG1OCON1), 3
#define CWG1OVRA                         BANKMASK(CWG1OCON0), 4
#define CWG1OVRB                         BANKMASK(CWG1OCON0), 5
#define CWG1OVRC                         BANKMASK(CWG1OCON0), 6
#define CWG1OVRD                         BANKMASK(CWG1OCON0), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1OCON0), 0
#define CWG1STRB                         BANKMASK(CWG1OCON0), 1
#define CWG1STRC                         BANKMASK(CWG1OCON0), 2
#define CWG1STRD                         BANKMASK(CWG1OCON0), 3
#define CWG1TMR2AS                       BANKMASK(CWG1AS1), 4
#define CWG1TMR4AS                       BANKMASK(CWG1AS1), 5
#define CWG1TMR6AS                       BANKMASK(CWG1AS1), 6
#define CWGASEL                          BANKMASK(APFCON), 6
#define CWGBSEL                          BANKMASK(APFCON), 5
#define CWGIE                            BANKMASK(PIE3), 5
#define CWGIF                            BANKMASK(PIR3), 5
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define D1PSS0                           BANKMASK(DAC1CON0), 2
#define D1PSS1                           BANKMASK(DAC1CON0), 3
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1OE                           BANKMASK(DAC1CON0), 5
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DAC1R5                           BANKMASK(DAC1CON1), 5
#define DAC1R6                           BANKMASK(DAC1CON1), 6
#define DAC1R7                           BANKMASK(DAC1CON1), 7
#define DAT0                             BANKMASK(CRCDATL), 0
#define DAT1                             BANKMASK(CRCDATL), 1
#define DAT10                            BANKMASK(CRCDATH), 2
#define DAT11                            BANKMASK(CRCDATH), 3
#define DAT12                            BANKMASK(CRCDATH), 4
#define DAT13                            BANKMASK(CRCDATH), 5
#define DAT14                            BANKMASK(CRCDATH), 6
#define DAT15                            BANKMASK(CRCDATH), 7
#define DAT2                             BANKMASK(CRCDATL), 2
#define DAT3                             BANKMASK(CRCDATL), 3
#define DAT4                             BANKMASK(CRCDATL), 4
#define DAT5                             BANKMASK(CRCDATL), 5
#define DAT6                             BANKMASK(CRCDATL), 6
#define DAT7                             BANKMASK(CRCDATL), 7
#define DAT8                             BANKMASK(CRCDATH), 0
#define DAT9                             BANKMASK(CRCDATH), 1
#define DBF0                             BANKMASK(CWG1DBF), 0
#define DBF1                             BANKMASK(CWG1DBF), 1
#define DBF2                             BANKMASK(CWG1DBF), 2
#define DBF3                             BANKMASK(CWG1DBF), 3
#define DBF4                             BANKMASK(CWG1DBF), 4
#define DBF5                             BANKMASK(CWG1DBF), 5
#define DBR0                             BANKMASK(CWG1DBR), 0
#define DBR1                             BANKMASK(CWG1DBR), 1
#define DBR2                             BANKMASK(CWG1DBR), 2
#define DBR3                             BANKMASK(CWG1DBR), 3
#define DBR4                             BANKMASK(CWG1DBR), 4
#define DBR5                             BANKMASK(CWG1DBR), 5
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DLEN0                            BANKMASK(CRCCON1), 4
#define DLEN1                            BANKMASK(CRCCON1), 5
#define DLEN2                            BANKMASK(CRCCON1), 6
#define DLEN3                            BANKMASK(CRCCON1), 7
#define FREE                             BANKMASK(PMCON1), 4
#define FULL                             BANKMASK(CRCCON0), 0
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1EN                             BANKMASK(CWG1CON0), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HADR0                            BANKMASK(SCANHADRL), 0
#define HADR1                            BANKMASK(SCANHADRL), 1
#define HADR10                           BANKMASK(SCANHADRH), 2
#define HADR11                           BANKMASK(SCANHADRH), 3
#define HADR12                           BANKMASK(SCANHADRH), 4
#define HADR13                           BANKMASK(SCANHADRH), 5
#define HADR14                           BANKMASK(SCANHADRH), 6
#define HADR15                           BANKMASK(SCANHADRH), 7
#define HADR3                            BANKMASK(SCANHADRL), 3
#define HADR4                            BANKMASK(SCANHADRL), 4
#define HADR5                            BANKMASK(SCANHADRL), 5
#define HADR6                            BANKMASK(SCANHADRL), 6
#define HADR7                            BANKMASK(SCANHADRL), 7
#define HADR8                            BANKMASK(SCANHADRH), 0
#define HADR9                            BANKMASK(SCANHADRH), 1
#define HARD2                            BANKMASK(SCANHADRL), 2
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define IN                               BANKMASK(CWG1CON1), 5
#define INAS                             BANKMASK(CWG1AS1), 0
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define INTM                             BANKMASK(SCANCON0), 3
#define INVALID                          BANKMASK(SCANCON0), 4
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define IS0                              BANKMASK(CWG1ISM), 0
#define IS1                              BANKMASK(CWG1ISM), 1
#define IS2                              BANKMASK(CWG1ISM), 2
#define LADR10                           BANKMASK(SCANLADRH), 2
#define LADR11                           BANKMASK(SCANLADRH), 3
#define LADR12                           BANKMASK(SCANLADRH), 4
#define LADR13                           BANKMASK(SCANLADRH), 5
#define LADR14                           BANKMASK(SCANLADRH), 6
#define LADR15                           BANKMASK(SCANLADRH), 7
#define LADR2                            BANKMASK(SCANLADRL), 2
#define LADR3                            BANKMASK(SCANLADRL), 3
#define LADR4                            BANKMASK(SCANLADRL), 4
#define LADR5                            BANKMASK(SCANLADRL), 5
#define LADR6                            BANKMASK(SCANLADRL), 6
#define LADR7                            BANKMASK(SCANLADRL), 7
#define LADR8                            BANKMASK(SCANLADRH), 0
#define LADR9                            BANKMASK(SCANLADRH), 1
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LD                               BANKMASK(CWG1CON0), 6
#define LDAR0                            BANKMASK(SCANLADRL), 0
#define LDAR1                            BANKMASK(SCANLADRL), 1
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LSAC0                            BANKMASK(CWG1AS0), 2
#define LSAC1                            BANKMASK(CWG1AS0), 3
